leandroschwarz/funsapeLib/_stuff/old_projects/STM32_system/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define NLED_Pin GPIO_PIN_13
#define NLED_GPIO_Port GPIOC
#define BOOT1_Pin GPIO_PIN_2
#define BOOT1_GPIO_Port GPIOB
#define SPI2_CS_SD_Pin GPIO_PIN_12
#define SPI2_CS_SD_GPIO_Port GPIOB
#define SPI1_CS_MPU1_Pin GPIO_PIN_15
#define SPI1_CS_MPU1_GPIO_Port GPIOA
#define SPI1_CS_MPU2_Pin GPIO_PIN_3
#define SPI1_CS_MPU2_GPIO_Port GPIOB
#define SPI1_CS_MPU3_Pin GPIO_PIN_4
#define SPI1_CS_MPU3_GPIO_Port GPIOB
#define SPI1_CS_MPU4_Pin GPIO_PIN_5
#define SPI1_CS_MPU4_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

// *INDENT-OFF*
#define ledTurnOn()						HAL_GPIO_WritePin(NLED_GPIO_Port, NLED_Pin, GPIO_PIN_RESET)
#define ledTurnOff()					HAL_GPIO_WritePin(NLED_GPIO_Port, NLED_Pin, GPIO_PIN_SET)
#define ledToggle()						HAL_GPIO_TogglePin(NLED_GPIO_Port, NLED_Pin)
#define ledPulseOn(delayMs)				do {					\
											ledTurnOn(); 		\
											HAL_Delay(delayMs);	\
											ledTurnOff();		\
											HAL_Delay(delayMs);	\
										} while (0)
#define ledPulseOff(delayMs)			do {					\
											ledTurnOff(); 		\
											HAL_Delay(delayMs);	\
											ledTurnOn();		\
											HAL_Delay(delayMs);	\
										} while (0)

// *INDENT-ON*

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
